# Curve Intersect Result Properties

Source: https://www.revitapidocs.com/2026/ccd9f1df-ab5a-0133-1665-3dfa48f9d9d1.htm

---

| Curve Intersect Result Properties |
| --- |

The CurveIntersectResult type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Result | The classification of intersection or overlap between the two curves. |

Top See Also

#### Reference

CurveIntersectResult Class Autodesk.Revit.DB Namespace